HronTurekFsi3/fluid/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidPatch plate;
solidZone plateZone;

fluidPatch plate;
fluidZone plateZone;

relaxationFactor 0.05;

interfaceDeformationLimit 0;

outerCorrTolerance 1e-6;
nOuterCorr 30;

interpolatorUpdateFrequency 0;

//couplingScheme Aitken;
couplingScheme IQN-ILS;

couplingReuse 0;

coupled no; // Will be swithed to yes by the function object
predictor yes;

// ************************************************************************* //
